data = {
    'Смартфон': {
        'Бренды': ['Apple', 'HONOR', 'HUAWEI', 'POCO', 'Samsung', 'Tecno', 'Xiaomi', 'ASUS', 'Blackview',
                   'CMF By Nothing', 'Coolpad', 'F+', 'Google', 'IIIF150', 'Infinix', 'INOI', 'itel',
                   'KENSHI', 'Motorola', 'Nothing', 'Nubia', 'OnePlus', 'OPPO', 'Oukitel', 'realme',
                   'Unihertz', 'Vivo', 'Wiko', 'CLEVERCEL', 'Doogee', 'IQOO', 'MEIZU', 'ULEFONE', 'Umidigi',
                   'Black Shark', 'Nokia', 'Redmi', 'Sony', 'TCL', 'Vertex', 'ZTE', 'Irbis', 'Jinga',
                   'Lenovo', 'Prestigio', 'LG'],
        'Параметры': {
            'Оперативная память': ['1 ГБ', '2 ГБ', '3 ГБ', '4 ГБ', '6 ГБ', '8 ГБ', '12 ГБ', '16 ГБ', '18 ГБ', '24 ГБ', '32 ГБ'],
            'Встроенная память': ['16 ГБ', '32 ГБ', '64 ГБ', '128 ГБ', '256 ГБ', '512 ГБ', '1 ТБ'],
            'Аккумулятор': ['от 1 до 3999 мАч', 'от 4000 до 4499 мАч', 'от 4500 до 4999 мАч',
                                     'от 5000 до 5499 мАч', 'от 5500 до 5999 мАч', 'от 6000 мАч'],
            'Камера': ['8 Мп', '12 Мп', '13 Мп', '16 Мп', '20 Мп', '32 Мп', '48 Мп', '50 Мп',
                                           '64 Мп', '100 Мп', '108 Мп', '180 Мп', '200 Мп'],
            'Цвет': ['бежевый', 'белый', 'голубой', 'желтый', 'зеленый', 'золотистый', 'красный', 'оранжевый',
                     'розовый', 'серебристый', 'серый', 'синий', 'фиолетовый', 'черный', 'другой'],
            'NFC': ['есть'],
            'Операционка': ['Android', 'IOS']
        },
        'Максимальная цена': 249_999,
        'Минимальная цена': 5570
    },
    'Телевизор': {
        'Бренды': ['DEXP', 'Haier', 'Hisense', 'LG', 'Samsung', 'TCL', 'Xiaomi', 'Accesstyle', 'Aceline', 'AIWA',
                   'AKAI', 'Asano', 'BBK', 'Blackton', 'BQ', 'Centek', 'Daewoo', 'ECON', 'Erisson', 'EVO TV',
                   'GoldStar', 'Harper', 'HIBERG', 'Hyundai', 'iFFALCON', 'Irbis', 'JVC', 'Kivi', 'Konka', 'Leff',
                   'MAUNFELD', 'MEGAMAX', 'Olto', 'Philips', 'Polar', 'Premier', 'Rombica', 'Sber', 'Scoole', 'Sharp',
                   'Shivaki', 'Skyline', 'Skyworth', 'Sony', 'Soundmax', 'Starwind', 'SUPRA', 'Topdevice', 'Vekta',
                   'Vesta', 'Яндекс', 'Digma', 'Digma Pro', 'SUNWIND', 'Yuno', 'Artel', 'AVEL', 'Carrera',
                   'Candy', 'Fusion', 'Grundig', 'Garlyn', 'Hi', 'Horizont', 'H', 'HIPER', 'HEC', 'Maibenben',
                   'National', 'Panasonic', 'Prestigio', 'RED solution', 'realme', 'Renova', 'Schaub Lorenz', 'Thomson',
                   'Toshiba', 'Telefunken', 'Tesla', 'Viomi', 'V-HOME', 'Витязь', 'Триколор', 'Loewe', 'Novex', 'Leran',
                   'Doffler'],
        'Параметры': {
            'Диагональ': ['до 31.9\'\'', 'от 32\'\' до 38.9\'\'', 'от 39\'\' до 45.9\'\'', 'от 46\'\' до 64.9\'\'',
                                 'от 65\'\' до 74.9\'\'', 'от 75\'\''],
            'Разрешение': ['HD (1366x768)', 'FullHD (1920x1080)', '4K UltraHD (3840x2160)', '8K UltraHD (7680x4320)'],
            'Smart TV': ['есть'],
            'Операционка': ['Android', 'Android TV', 'Google TV', 'WebOS', 'YaOS', 'Салют ТВ', 'Tizen', 'Vidaa',
                                     'другая'],
            'Цвет': ['черный', 'белый', 'серебристый', 'серый', 'другой']
        },
        'Максимальная цена': 1_999_999,
        'Минимальная цена': 9299
    },
    'Ноутбук': {
        'Бренды': ['Acer', 'Apple', 'ARDOR GAMING', 'ASUS', 'HONOR', 'HUAWEI', 'MSI', 'ACD', 'Acer Gadget', 'AORUS',
                   'Chuwi', 'ColorFul', 'Dell', 'DEXP', 'F+', 'Gateway', 'GIGABYTE', 'Hasee', 'HIPER', 'HP', 'Infinix',
                   'Irbis', 'IRU', 'Lenovo', 'Machcreator', 'Machenike', 'MAIBENBEN', 'Microsoft', 'OSIO', 'Razer',
                   'Samsung', 'Tecno', 'Unchartevice', 'Xiaomi', 'Digma', 'Digma Pro', 'ECHIPS', 'HORIZONT', 'RIKOR',
                   'AZERTY', 'ADATA', 'Blackview', 'DREAM-MACHINES', 'Haier', 'Itel', 'KWIK', 'LYAMBDA', 'Nerpa',
                   'Rombica', 'realme', 'Redmi', 'Sledgehammer', 'Thunderobot'],
        'Параметры': {
            'Диагональ': ['до 12.9\'\'', 'от 13\'\' до 13.9\'\'', 'от 14\'\' до 14.9\'\'',
                                 'от 15\'\' до 15.9\'\'', 'от 16\'\' до 16.9\'\'', 'от 17\'\''],
            'Оперативная память': ['4 ГБ', '6 ГБ', '8 ГБ', '12 ГБ', '16 ГБ', '18 ГБ', '24 ГБ', '32 ГБ', '36 ГБ', '48 ГБ',
                                   '64 ГБ', '96 ГБ', '128 ГБ'],
            'Процессор': ['Intel', 'AMD', 'Apple', 'Qualcomm', 'Zhaoxin'],
            'Тип видеокарты': ['дискретная', 'интегрированная', 'дискретная и интегрированная'],
            'Объем SSD': ['128 ГБ', '256 ГБ', '512 ГБ', '1 ТБ', '2 ТБ', '4 ТБ'],
            'Операционка': ['без ОС', 'Windows', 'Windows (пробная)', 'macOS', 'Linux', 'FreeDOS', 'Eshell'],
            'Игровой': ['да'],
            'Тип экрана': ['IPS', 'OLED', 'TN', 'AMOLED', 'LTPS', 'другой'],
            'Цвет': ['черный', 'серый', 'серебристый', 'синий', 'белый', 'другой'],
            'Материал корпуса': ['металл', 'пластик']
        },
        'Максимальная цена': 752_990,
        'Минимальная цена': 17499
    },
    'Планшет': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 357_599,
        'Минимальная цена': 2099
    },
    'Клавиатура': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 32060,
        'Минимальная цена': 299
    },
    'Мышь': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 22999,
        'Минимальная цена': 159
    },
    'Монитор': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 869_999,
        'Минимальная цена': 4999
    },
    'Видеокарта': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 620_999,
        'Минимальная цена': 3110
    },
    'Процессор': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 559_999,
        'Минимальная цена': 790
    },
    'Игровые наушники': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 98760,
        'Минимальная цена': 399
    },
    'Материнская плата': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 179_999,
        'Минимальная цена': 4437
    },
    'Игровая консоль': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 135_990,
        'Минимальная цена': 799
    },
    'Смарт-часы': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 282_999,
        'Минимальная цена': 399
    },
    'Bluetooth колонка': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 188_790,
        'Минимальная цена': 399
    },
    'Электрочайник': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 44900,
        'Минимальная цена': 400
    },
    'Пылесос': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 157_500,
        'Минимальная цена': 399
    },
    'Холодильник': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 599_999,
        'Минимальная цена': 7999
    },
    'Стиральная машина': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 719_999,
        'Минимальная цена': 5499
    },
    'Микроволновка': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 107_990,
        'Минимальная цена': 4499
    },
    'Электрическая плита': {
        'Бренды': [],
        'Параметры': {

        },
        'Максимальная цена': 174_170,
        'Минимальная цена': 13799
    },
}