data = {
    'Смартфоны': {
        'Бренды': ['Apple', 'HONOR', 'HUAWEI', 'POCO', 'Samsung', 'Tecno', 'Xiaomi', 'ASUS', 'Blackview',
                   'CMF By Nothing', 'Coolpad', 'F+', 'Google', 'IIIF150', 'Infinix', 'INOI', 'itel',
                   'KENSHI', 'Motorola', 'Nothing', 'Nubia', 'OnePlus', 'OPPO', 'Oukitel', 'realme',
                   'Unihertz', 'Vivo', 'Wiko', 'CLEVERCEL', 'Doogee', 'IQOO', 'MEIZU', 'ULEFONE', 'Umidigi',
                   'Black Shark', 'Nokia', 'Redmi', 'Sony', 'TCL', 'Vertex', 'ZTE', 'Irbis', 'Jinga',
                   'Lenovo', 'Prestigio', 'LG'],
        'Параметры': {
            'Оперативная память': ['1 ГБ', '2 ГБ', '3 ГБ', '4 ГБ', '6 ГБ', '8 ГБ', '12 ГБ', '16 ГБ', '18 ГБ', '24 ГБ', '32 ГБ'],
            'Встроенная память': ['16 ГБ', '32 ГБ', '64 ГБ', '128 ГБ', '256 ГБ', '512 ГБ', '1 ТБ'],
            'Емкость аккумулятора': ['от 1 до 3999 мАч', 'от 4000 до 4499 мАч', 'от 4500 до 4999 мАч',
                                     'от 5000 до 5499 мАч', 'от 5500 до 5999 мАч', 'от 6000 мАч'],
            'Разрешение основной камеры': ['8 Мп', '12 Мп', '13 Мп', '16 Мп', '20 Мп', '32 Мп', '48 Мп', '50 Мп',
                                           '64 Мп', '100 Мп', '108 Мп', '180 Мп', '200 Мп'],
            'Цвет': ['бежевый', 'белый', 'голубой', 'желтый', 'зеленый', 'золотистый', 'красный', 'оранжевый',
                     'розовый', 'серебристый', 'серый', 'синий', 'фиолетовый', 'черный'],
            'NFC': ['есть', 'нет'],
            'Операционная система': ['Android', 'IOS']
        }
    }
}